In [2]:
import pandas as pd

In [5]:
orders = pd.read_table("http://bit.ly/chiporders")

In [16]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [19]:
user_cols = ['userid', 'age', 'gender', 'occupation', 'zipcode']
users = pd.read_table("http://bit.ly/movieusers", sep='|', header=None, names=user_cols)

In [20]:
users.head(2)

   userid  age gender  occupation zipcode
0       1   24      M  technician   85711
1       2   53      F       other   94043

In [21]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
userid        943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zipcode       943 non-null object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [26]:
users.describe()

           userid         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [56]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry" , usecols=[0, 1,2], nrows=3)

In [57]:
drinks

       country  beer_servings  spirit_servings
0  Afghanistan              0                0
1      Albania             89              132
2      Algeria             25                0

In [58]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry" ,  usecols=['country', 'beer_servings', 'spirit_servings'], nrows=3)

In [59]:
drinks

       country  beer_servings  spirit_servings
0  Afghanistan              0                0
1      Albania             89              132
2      Algeria             25                0

#### Iterating through rows

In [62]:
for i in drinks.country:
    print(i)

Afghanistan
Albania
Algeria

In [86]:
for index, rows in drinks.iterrows(): #itertuples, iteritems
    print(index, rows.country, rows.beer_servings)

0 Afghanistan 0
1 Albania 89
2 Algeria 25

In [87]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry" )

In [88]:
drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

#### change data types of the columuns

In [89]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [93]:
drinks['beer_servings'] = drinks.beer_servings.astype(float)

In [94]:
drinks.dtypes

country                          object
beer_servings                   float64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [97]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry", dtype={'spirit_servings':float})

In [98]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                 float64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

####  change price from str to float

In [105]:
orders = pd.read_table("http://bit.ly/chiporders")

In [106]:
orders.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [109]:
orders.item_price.str.replace('$', '').astype(float).mean()

7.464335785374397

In [115]:
chicken_orders = orders.item_name.str.contains('Chicken').astype(int)

In [117]:
orders['chicken_orders'] = chicken_orders

In [121]:
orders[orders.chicken_orders == 1]

,order_id,quantity,item_name,choice_description,item_price,chicken_orders
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,1
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98,1
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,1
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75,1
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25,1
...,...,...,...,...,...,...
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75,1
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75,1
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,1
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,1
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,1